[
  {
    "name": "The Bridge",
    "date": "Jan 2022 - May 2023",
    "current": true,
    "url": "https://www.thebridge.social/es/",
    "position": "Senior Android Developer",
    "description": "Deliver high-quality, robust production code for a mutual funds Android native app. I collaborated closely with product managers, designers, ios developers, sre engineers and backend developers to understand the requirements and translate them into scalable and efficient Android solutions.",
    "technologies": ["Java", "Kotlin", "MVVM", "CI/CD"]
  },

  {
    "name": "Novatech",
    "date": "Nov 2020 - Jan 2022",
    "current": false,
    "url": "https://www.novatechdev.com/",
    "position": "Senior Android Developer",
    "description": "As a Senior Android Developer at Novatech, I have gained extensive experience in developing diverse types of apps, ranging from start-ups to bank and financial institutions.",
    "technologies": ["Kotlin", "Compose", "Mockk", "Flows"]
  },
  {
    "name": "Fitune",
    "date": "Feb 2020 - Nov 2020",
    "current": false,
    "url": "https://es.fitune.io/",
    "position": "Android Developer",
    "description": "In my role as an Android Developer , I have been instrumental in shaping and implementing the mobile application's core features and functionality. Collaborating closely with the product team, I have contributed to creating an engaging user experience, integrating features such as workout tracking, personalized training plans.",
    "technologies": ["Kotlin", "MVVM", "Rx Java", "Vue.js"]
  },
  {
    "name": "Elaniin",
    "date": "Jun 2019 - Jan 2020",
    "current": false,
    "url": " https://www.elaniin.com/",
    "position": "Android Developer",
    "description": "As an Android Developer at Elaniin, I have had the privilege of working on a challenging and impactful project, developing a bank application. Collaborating closely with the client, I have been responsible for designing and implementing key features and functionalities that meet the stringent requirements of the banking industry.",
    "technologies": ["Kotlin", "MVVM", "Jetpack", "Retrofit"]
  },
  {
    "name": "Freelance / Indie",
    "date": "Jun 2017 - Jun 2019",
    "current": false,
    "url": "#",
    "position": "Android Developer",
    "description": "As a indie Android developer, I have had the opportunity to work on a diverse range of projects, taking on the role of both developer and entrepreneur.",
    "technologies": ["Kotlin", "Java", "Rx Java", "MVI"]
  }
]
